src/share_it/recent_reading3.en.md


# Share a List of Recently Reading Books(Season 3)

1.  [Category Theory for Programmers](#org034452c)
2.  [The Practice of Programming](#org593ae58)
3.  [Introduction to Game Programming (C++)](#org0f04e90)
4.  [Javascript For Impatient Programmers](#org44766d6)
5.  [Deep JavaScript](#org882bb50)
6.  [The Art of PostgreSQL](#org4154e48)
7.  [The Passionate Programmer: Creating a Remarkable Career in Software Development](#org0a73777)
8.  [Remote: Office Not Required](#org2c1d750)
9.  [The Clean Coder：A Code of Conduct for Professional Programmers](#orge1e0a03)
10. [Learn C++](#org2186970)


<a id="org034452c"></a>

## Category Theory for Programmers<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>


<a id="org593ae58"></a>

## The Practice of Programming<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>


<a id="org0f04e90"></a>

## Introduction to Game Programming (C++)<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>


<a id="org44766d6"></a>

## Javascript For Impatient Programmers<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>


<a id="org882bb50"></a>

## Deep JavaScript<sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup>


<a id="org4154e48"></a>

## The Art of PostgreSQL<sup><a id="fnr.6" class="footref" href="#fn.6" role="doc-backlink">6</a></sup>


<a id="org0a73777"></a>

## The Passionate Programmer: Creating a Remarkable Career in Software Development<sup><a id="fnr.7" class="footref" href="#fn.7" role="doc-backlink">7</a></sup>


<a id="org2c1d750"></a>

## Remote: Office Not Required<sup><a id="fnr.8" class="footref" href="#fn.8" role="doc-backlink">8</a></sup>


<a id="orge1e0a03"></a>

## The Clean Coder：A Code of Conduct for Professional Programmers<sup><a id="fnr.9" class="footref" href="#fn.9" role="doc-backlink">9</a></sup>


<a id="org2186970"></a>

## Learn C++<sup><a id="fnr.10" class="footref" href="#fn.10" role="doc-backlink">10</a></sup>


# Related Contents

1.  [Share a List of Recently Reading Books(Season 1)](https://tiglapiles.github.io/article/src/share_it/recent_reading.html)
2.  [Share a List of Recently Reading Books(Season 2)](https://tiglapiles.github.io/article/src/share_it/recent_reading2.zh.html)
3.  [The Article Address](https://tiglapiles.github.io/article/src/share_it/recent_reading3.zh.html)
4.  View My [github](https://github.com/tiglapiles/article) For More
5.  Sponsor My [Games](https://itch.io/profile/tiglapiles)
6.  [Community Address](https://www.v2ex.com/t/805027)
7.  Email: tiglapiles@gmail.com


# Footnotes

<sup><a id="fn.1" href="#fnr.1">1</a></sup> <https://calculusmadeeasy.org/>

<sup><a id="fn.2" href="#fnr.2">2</a></sup> <https://teachyourselfcs.com/>

<sup><a id="fn.3" href="#fnr.3">3</a></sup> <https://book.douban.com/subject/34781358/>

<sup><a id="fn.4" href="#fnr.4">4</a></sup> <https://book.douban.com/subject/30459914/>

<sup><a id="fn.5" href="#fnr.5">5</a></sup> <https://github.com/winitzki/sofp>

<sup><a id="fn.6" href="#fnr.6">6</a></sup> <https://ocw.mit.edu/courses/mathematics/18-06-linear-algebra-spring-2010/video-lectures/>

<sup><a id="fn.7" href="#fnr.7">7</a></sup> <https://book.douban.com/subject/2053608/>

<sup><a id="fn.8" href="#fnr.8">8</a></sup> <https://ocw.mit.edu/resources/res-tll-005-how-to-speak-january-iap-2018/how-to-speak/index.htm>

<sup><a id="fn.9" href="#fnr.9">9</a></sup> <https://book.douban.com/subject/3582335/>

<sup><a id="fn.10" href="#fnr.10">10</a></sup> <https://book.douban.com/subject/1232201/>
